test/site/content-org/all-posts.org
#+HUGO_BASE_DIR: ../
#+SEQ_TODO: TODO DRAFT DONE
#+PROPERTY: header-args :eval no
#+MACRO: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]

* DONE Parsing date from CLOSED property :post_heading_followed_soon_with_subheading:
CLOSED: [2017-09-11 Mon 14:32]
:PROPERTIES:
:EXPORT_FILE_NAME: parsing-date-from-closed-property
:END:
** The "CLOSED" state of this heading (which is nil) should be ignored
When an Org TODO item is switched to the =DONE= state, a =CLOSED=
property is auto-inserted (default behavior).

If such a property is non-nil, the value (time-stamp) of that is used
to set the =date= field in the exported front-matter.

- Reference :: [[http://orgmode.org/manual/Special-properties.html][(org) Special properties]] or =C-h i g (org) Special properties=
